# <center>Assignment #1. Task </center> <a class="tocSkip">
## <center>Exploratory Data Analysis (EDA) of Olympic games with Pandas </center> <a class="tocSkip">
    
<img src="https://habrastorage.org/webt/my/70/d9/my70d97xhwfj8krp2q2qmn_smww.png" width=50%>

There are ten questions about 120 years of Olympic history in this assignment.

### Your task is to:
 1. write code and perform computations in the cells below;
 2. choose answers in the [webform](https://docs.google.com/forms/d/1SJcNJxnY5Wwb_sDSxmb-FyghraeOt-ZmQMA0XzOLu4I).
 
*If you are sure that something is not 100% correct with the assignment/solution, please leave your feedback via the mentioned webform â†‘*

-----

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [2]:
from pathlib import Path
import os
import pandas as pd

In [3]:
os.chdir('/content/drive/MyDrive/ods/mlcourse_ai_bonus_jupyter_book')

In [4]:
os.getcwd()

'/content/drive/MyDrive/ods/mlcourse_ai_bonus_jupyter_book'

In [5]:
PATH_TO_DATA = Path("_static/data/assignment1")

In [6]:
df = pd.read_csv(PATH_TO_DATA / "athlete_events.csv.zip", index_col="ID")
df.head(2)

,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
ID,,,,,,,,,,,,,,
1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN

 The dataset has the following features:

- __ID__ â€“ Unique number for each athlete
- __Name__ â€“ Athlete's name
- __Sex__ â€“ M or F
- __Age__ â€“ Integer
- __Height__ â€“ In centimeters
- __Weight__ â€“ In kilograms
- __Team__ â€“ Team name
- __NOC__ â€“ National Olympic Committee 3-letter code
- __Games__ â€“ Year and season
- __Year__ â€“ Integer
- __Season__ â€“ Summer or Winter
- __City__ â€“ Host city
- __Sport__ â€“ Sport
- __Event__ â€“ Event
- __Medal__ â€“ Gold, Silver, Bronze, or NA

**<font color='red'>Question 1.</font> How old were the youngest male and female participants of the 1992 Olympics?**

- 16 and 15
- 14 and 13 
- 13 and 11
- 11 and 12 **<font color='red'>+</font>**

In [7]:
df[(df['Sex']=='M')&(df['Year']==1992)]['Age'].min()

11.0

In [8]:
df[(df['Sex']=='F')&(df['Year']==1992)]['Age'].min()

12.0

**<font color='red'>Question 2.</font> What was the percentage of male basketball players among all the male participants of the 2012 Olympics? Round the answer to the first decimal.**

*Hint:* drop duplicate athletes where necessary to count each athlete just once. This applies to other questions as well.

- 0.2
- 1.5 
- 2.5 **<font color='red'>+</font>**
- 7.7

In [9]:
len(df[(df['Sex']=='M')&(df['Year']==2012)&(df['Sport']=='Basketball')]['Name'].unique())/len(df[(df['Sex']=='M')&(df['Year']==2012)&(df['Sport']=='Basketball')])

1.0

In [10]:
df[(df['Sex']=='M')&(df['Year']==2012)]['Name'].value_counts()

Flavius Koczi                8
Kristian James Thomas        8
Kim Su-Myeon                 8
Oleh Yuriyovych Verniaiev    8
Koji Yamamuro                8
                            ..
Igor Hini                    1
Philip Hindes                1
Moustapha Abdoulaye Hima     1
Blair Hilton                 1
ukasz Tomasz ygado           1
Name: Name, Length: 5858, dtype: int64

In [11]:
df[(df['Year']==2012)&(df['Name']=='Flavius Koczi')]

,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
ID,,,,,,,,,,,,,,
61839,Flavius Koczi,M,24.0,162.0,57.0,Romania,ROU,2012 Summer,2012,Summer,London,Gymnastics,Gymnastics Men's Individual All-Around,NaN
61839,Flavius Koczi,M,24.0,162.0,57.0,Romania,ROU,2012 Summer,2012,Summer,London,Gymnastics,Gymnastics Men's Team All-Around,NaN
61839,Flavius Koczi,M,24.0,162.0,57.0,Romania,ROU,2012 Summer,2012,Summer,London,Gymnastics,Gymnastics Men's Floor Exercise,NaN
61839,Flavius Koczi,M,24.0,162.0,57.0,Romania,ROU,2012 Summer,2012,Summer,London,Gymnastics,Gymnastics Men's Horse Vault,NaN
61839,Flavius Koczi,M,24.0,162.0,57.0,Romania,ROU,2012 Summer,2012,Summer,London,Gymnastics,Gymnastics Men's Parallel Bars,NaN
61839,Flavius Koczi,M,24.0,162.0,57.0,Romania,ROU,2012 Summer,2012,Summer,London,Gymnastics,Gymnastics Men's Horizontal Bar,NaN
61839,Flavius Koczi,M,24.0,162.0,57.0,Romania,ROU,2012 Summer,2012,Summer,London,Gymnastics,Gymnastics Men's Rings,NaN
61839,Flavius Koczi,M,24.0,162.0,57.0,Romania,ROU,2012 Summer,2012,Summer,London,Gymnastics,Gymnastics Men's Pommelled Horse,NaN

In [12]:
basketball = len(df[(df['Sex']=='M')&(df['Year']==2012)&(df['Sport']=='Basketball')])

In [13]:
all_sports = len(df[(df['Sex']=='M')&(df['Year']==2012)].drop_duplicates(subset = 'Name'))

In [14]:
# You code here 
round((basketball/all_sports)*100, 1)

2.5

**<font color='red'>Question 3.</font> What are the mean and standard deviation of height for female tennis players who participated in the 2000 Olympics? Round the answer to the first decimal.**

- 171.8 and 6.5 **<font color='red'>+</font>**
- 179.4 and 10
- 180.7 and 6.7
- 182.4 and 9.1

In [ ]:
sorted(df['Sport'].unique())

In [16]:
# You code here
q_female_tennis_2000 = '(Year == 2000) & (Sex == "F") & (Sport == "Tennis")'
round(df.query(q_female_tennis_2000).drop_duplicates(subset = 'Name').Height.std(), 1)

6.6

In [17]:
round(df.query(q_female_tennis_2000).drop_duplicates(subset = 'Name').Height.mean(),1)

171.8

**<font color='red'>Question 4.</font> Find the heaviest athlete among 2006 Olympics participants. What sport did he or she do?**

- Judo
- Bobsleigh 
- Skeleton **<font color='red'>+</font>**
- Boxing

In [18]:
# You code here

In [19]:
max_weight_2006 = df[df['Year']==2006]['Weight'].max()

In [20]:
df[(df['Year']==2006)&(df['Weight']==max_weight_2006)]['Sport'].iloc[0]

'Skeleton'

**<font color='red'>Question 5.</font> How many times did John Aalberg participate in the Olympics held in different years?**

- 0
- 1 
- 2 **<font color='red'>+</font>**
- 3

In [21]:
# You code here
df[df['Name']=='John Aalberg']['Year'].nunique()

2

**<font color='red'>Question 6.</font> How many gold medals in tennis did the Switzerland team win at the 2008 Olympics?**

- 0
- 1 
- 2 **<font color='red'>+</font>**
- 3

In [22]:
# You code here
swiss_tennis_2008_gold = '(Team == "Switzerland") & (Sport == "Tennis") & (Year == 2008) & (Medal == "Gold")'
len(df.query(swiss_tennis_2008_gold))

2

In [23]:
# OR for more cases
swiss_2008 = '(Team == "Switzerland") & (Year == 2008)'
(df.query(swiss_2008).groupby(["Medal", "Sport"]).get_group(("Gold", "Tennis")).shape[0])

2

**<font color='red'>Question 7.</font>  Is it true that Spain won fewer medals than Italy at the 2016 Olympics? Do not consider NaN values in the _Medal_ column.**

- Yes **<font color='red'>+</font>**
- No

In [24]:
# You code here 
spain = len(
    df.query('(Year == 2016) & (Team == "Spain")').dropna(subset=["Medal"])
)

italy = len(
    df.query('(Year == 2016) & (Team == "Italy")').dropna(subset=["Medal"])
)

spain, italy

(43, 70)

**<font color='red'>Question 8.</font> What are the least and most common age groups among the participants of the 2008 Olympics?**
- [45-55] and [25-35) correspondingly
- [45-55] and [15-25) correspondingly **<font color='red'>+</font>**
- [35-45) and [25-35) correspondingly
- [45-55] and [35-45) correspondingly

In [32]:
q_15_25 = '(Age >= 15) & (Age < 25) & (Year == 2008)'
q_25_35 = '(Age >= 25) & (Age < 35) & (Year == 2008)'
q_35_45 = '(Age >= 35) & (Age < 45) & (Year == 2008)'
q_45_55 = '(Age >= 45) & (Age <= 55) & (Year == 2008)'

In [37]:
len(df.query(q_15_25).drop_duplicates(subset="Name"))

4783

In [38]:
len(df.query(q_25_35).drop_duplicates(subset="Name"))

5376

In [39]:
len(df.query(q_35_45).drop_duplicates(subset="Name"))

630

In [40]:
len(df.query(q_45_55).drop_duplicates(subset="Name"))

78

In [43]:
# another way 
def age_category(age):
    """identifies the interval"""
    
    if 15 <= age < 25:
        return "[15, 25)"
    elif 25 <= age < 35:
        return "[25, 35)"
    elif 35 <= age < 45:
        return "[35, 45)"
    elif 45 <= age <= 55:
        return "[45, 55]"

In [44]:
# applying to each row the fuction of age interval detection
df["age_category"] = df.Age.map(age_category)

In [45]:
df[df['Year'] == 2008].drop_duplicates(subset="Name").groupby("age_category").size()

age_category
[15, 25)    4776
[25, 35)    5373
[35, 45)     630
[45, 55]      78
dtype: int64

**<font color='red'>Question 9.</font> Is it true that there were Summer Olympics held in Atlanta? Is it true that there were Winter Olympics held in Squaw Valley?**

- Yes, Yes **<font color='red'>+</font>**
- Yes, No
- No, Yes 
- No, No

In [46]:
df.head(2)

,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal,age_category
ID,,,,,,,,,,,,,,,
1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN,"[15, 25)"
2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN,"[15, 25)"

In [48]:
q_summer_atlanta = '(City == "Atlanta") & (Season == "Summer")'
q_winter_SV = '(City == "Squaw Valley") & (Season == "Winter")'

In [50]:
len(df.query(q_summer_atlanta))

13780

In [51]:
len(df.query(q_winter_SV))

1116

In [53]:
# shorter way 
pd.crosstab(df['City'], df['Season']).loc[["Atlanta", "Squaw Valley"]]

Season        Summer  Winter
City
Atlanta        13780       0
Squaw Valley       0    1116

**<font color='red'>Question 10.</font> What is the absolute difference between the number of unique sports at the 1994 Olympics and 2002 Olympics?**

- 3
- 10
- 15 
- 27

In [59]:
abs(df[df['Year']==1994]['Sport'].nunique() - df[df['Year']==2002]['Sport'].nunique())

3